Repository: vbuchara/vbuchara-portfolio
Catalog: plugins/image-regenerate-select-crop/langs/sirsc-*.po
Languages: ro_ro

source: This option allows you to generate only images that match exactly the width and height of the crop/resize requirements, when the option is enabled. Otherwise, the script will generate anything possible for smaller images.
ro_ro: Această opțiune vă permite să generați doar imagini care se potrivesc perfect cu lățimea și înălțimea necesare pentru decuparea/scalare, când aceasta este activată. Altfel, scriptul va genera orice se poate pentru imaginile mai mici.

source: attempt to upscale when generating only perfect fit sizes
ro_ro: încearcă mărirea când se generează doar mărimi care se potrivesc perfect

source: This option allows you to upscale the images when using the perfect fit option. This allows that images that have at least the original width close to the expected width or the original height close to the expected height (for example, the original image has 800x600 and the crop size 700x700) to be generated from a upscaled image.
ro_ro: Această opțiune vă permite să măriți imaginile când se folosește opțiunea de potrivire perfectă. Acest lucru permite ca imaginile care au cel puțin lățimea originală apropiată de lățimea așteptată sau înălțimea originală apropiată de înălțimea așteptată (de exemplu, imaginea originală are 800x600 și mărimea tăiată 700x700) să poată fi generate dintr-o imagine mărită.

source: regenerate only missing files
ro_ro: regenerare doar pentru fișierelor lipsă

source: When using the bulk actions, this option allows you to regenerate only the images that do not exist, without overriding the existing ones.
ro_ro: Când folosiți acțiuni în masă, această opțiune vă permite să regenerați doar imaginile care nu există, fără a le suprascrie pe cele existente.

source: regenerate/cleanup only featured images
ro_ro: regenerare/curățare doar a imaginilor reprezentative

source: When using the bulk actions, this option allows you to regenerate/cleanup only the images that are set as featured image for any of the posts.
ro_ro: Când folosiți acțiuni în masă, această opțiune vă permite să regenerați/curățați doar imaginile care sunt setate ca imagine reprezentativă pentru oricare dintre articole.

source: Option to Enable Placeholders
ro_ro: Opțiune de activare substituenți

source: no placeholder
ro_ro: fără substituent

source: force global
ro_ro: forțează global

source: only missing images
ro_ro: numai imagini lipsă

source: This option allows you to display placeholders for the front-side images called programmatically (the images that are not embedded in the content with their src, but exposed using WordPress native functions). If there is no placeholder set, then the WordPress default behavior would be to display the full-size image instead of a missing image size, hence your pages might load slower, and when using grids, the items would not look even.
ro_ro: Această opțiune vă permite să afișați substituenți ale imaginilor din partea frontală care sunt apelate programatic (imagini care nu sunt încorporate în conținut cu adresa lor, ci cele expuse folosind funcții native WordPress). Dacă nu a fost setat niciun substituent, atunci comportamentul implicit WordPress este acela de a afișa imaginea la mărime completă în loc de o dimensiune de imagine lipsă, prin urmare, paginile s-ar putea încărca mai lent, și atunci când se utilizează grile, elementele nu ar arăta egale.

source: This feature might not work properly, your placeholders folder is not writtable.
ro_ro: Este posibil ca această acțiune să nu funcționeze corect, în directorul pentru substituenți nu se poate scrie.

source: If you activate the "force global" option, all the images on the front-side that are related to posts will be replaced with the placeholders that mention the image size required. This is useful for debugging, to quickly identify the image sizes used for each layout and perhaps to help you regenerate the mission ones or decide what to keep or what to remove.
ro_ro: Dacă activați opțiunea "forțează global", toate imaginile de pe partea frontală care sunt legate de posturi vor fi înlocuite cu substituenți care menționează dimensiunea imaginii necesare. Acest lucru este util pentru depanare, pentru a identifica rapid dimensiunile imaginii utilizate pentru fiecare aspect și, probabil, pentru a vă ajuta să le regenerați pe cele lipsă sau pentru a decide ce să păstrați sau ce să eliminați.

source: If you activate the "only missing images" option, all the programmatically called images on the front-side that are related to posts and do not have the requested image size generated will be replaced with the placeholders that mention the image size required. This is useful for showing smaller images instead of the full-size images (as WordPress does by default), hence for speeding up the pages loading.
ro_ro: Dacă activați opțiunea "numai imagini lipsă", toate imaginile apelate programatic pe partea frontală, care sunt legate de articole și care nu au imagine generată la dimensiunea dorită vor fi înlocuite cu substituenți care menționează dimensiunea imaginii necesare. Acest lucru este util pentru afișarea imaginilor mai mici în loc de imagini complete (ce facă WordPress în mod implicit), prin urmare, pentru accelerarea încărcării paginilor.

source: Apply the settings below for the selected option
ro_ro: Aplicați setările de mai jos pentru opțiunea selectată

source: The options for which you made some settings are marked with * in the dropdown below.
ro_ro: Opțiunile pentru care ați făcut unele setări sunt marcate cu * în meniul vertical de mai jos.

source: When you select a post type the general options will not be editable, only these that can apply to the images attached to a post will be available for updates.
ro_ro: Când selectați un tip de articol, setările generale devin needitabile, doar setările care se aplică imaginilor atașate articolelor vor fi disponibile pentru modificări.

source: General settings (used as default for all images)
ro_ro: Setări generale (utilizate ca implicite pentru toate imaginile)

source: Settings for images attached to a
ro_ro: Setări pentru imaginile atașate la

source: Select the general settings that applies to all, or only one of the post types if necessary.
ro_ro: Selectați setări generale ce se aplică tuturor, sau doar unui tip de articol dacă e necesar.

source: This plugin provides the option to select image sizes that will be excluded from the generation of the new images. By default, all image sizes defined in the system will be allowed (these are programmatically registered by the themes and plugins you activate in your site, without you even knowing about these). You can set up a global configuration, or more specific configuration for all images attached to a particular post type. If no particular settings are made for a post type, then the default general settings will be used.
ro_ro: Acest modul oferă opțiunea de a selecta mărimile de imagine care vor fi excluse din generarea de noi imagini. În mod implicit, toate mărimile de imagine definite în sistem vor fi permise (acestea sunt înregistrate prin programare în temele și modulele pe care le activați în situl dvs., fără ca măcar să știți despre acestea). Aveți posibilitatea să setați o configurație globală sau o configurație mai specifică pentru fiecare din imaginile atașate unui anumit tip de articol. Dacă nu sunt făcute anumite setări pentru un tip de articol, atunci vor fi utilizate setările generale implicite.

source: Click the button to reset all settings for this plugin. The reset will not remove the custom registered image sizes, but only the settings.
ro_ro: Apăsați pe buton pentru a reseta toate setările acestui modul. Resetarea nu va șterge mărimile de imagine personalizare care au fost înregistrate, ci doar setările modulului.

source: Reset
ro_ro: Resetare

source: This option allows you to exclude globally from the application some of the image sizes that are registered through various plugins and themes options, that you perhaps do not need at all in your application (these are just stored in your folders and database but not actually used/visible on the front-end).
ro_ro: Această opțiune vă permite să excludeți în mod global din aplicație unele dintre dimensiunile de imagini înregistrate prin diverse module sau opțiuni de teme, de care cel mai probabil nu aveți nevoie în aplicație (aceste sunt doar stocate în directoare și în baza de date dar nu sunt de fapt folosite/vizibile în partea frontală).

source: By excluding these, the unnecessary image sizes will not be generated at all.
ro_ro: Excluzându-le pe acestea, mărimile de imagine nenecesare nu se vor genera deloc.

source: The quality option is allowing you to control the quality of the images that are generated for each of the image sizes, starting from the quality of the image you upload. This can be useful for performance.
ro_ro: Opțiunea pentru calitate vă permite să controlați calitate imaginilor care sunt generate pentru fiecare dimensiune a imaginii, pornind de la calitatea imaginii încărcate. Acest lucru poate fi util pentru performanță.

source: However, please be careful not to change the quality of the full image or the quality of the image size that you set as the forced original.
ro_ro: Totuși, vă rugăm să fiți atenți să nu modificați calitatea imaginii originale sau cea a mărimii de imagine pe care ați setat-o ca original forțat.

source: Setting a lower quality is recommended for smaller images sizes, that are generated from the full/original file.
ro_ro: Setarea unei calități mai mici este recomandată pentru mărimile mici de imagine, cele care sunt generate din fișierul complet/original.

source: This option means that when uploading an image, the original image will be replaced completely by the image size you select (the image generated, scaled or cropped to a specific width and height will become the full size for that image going further).
ro_ro: Această opțiune înseamnă că atunci când se încarcă o imagine, imagine originală va fi înlocuită complet de către mărimea de imagine pe care o selectați (imagine generată, redimensionată sau tăiată la o lățime și înălțime specifică va deveni imagine completă care va fi folosită mai departe pentru acea imagine).

source: This can be very useful if you do not use the original image in any of the layouts at the full size, and this might save some storage space.
ro_ro: Aceasta poate fi foarte utilă dacă nu folosiți imaginea originală în nicio machetă la mărimea completă, și acest lucru ar putea salva niște spațiu de stocare.

source: Leave "nothing selected" to keep the full/original image as the file you upload (default WordPress behavior).
ro_ro: Lăsați "nimic selectat" pentru a păstra imaginea originală/completă ca și fișierul pe care îl încărcați (comportamentul implicit WordPress).

source: This option allows you to hide from the "Image Regenerate & Select Crop Settings" lightbox the details and options for the selected image sizes (when you or other admins are checking the image details, the hidden image sizes will not be shown).
ro_ro: Această opțiune vă permite să ascundeți din caseta "Setări pentru regenerare & tăiere selectivă imagine" detaliile și opțiunile mărimilor de imagine selectate (când dvs. sau alți administratori verificați detaliile imaginii, mărimile de imagine ascunse nu se vor arăta).

source: This is useful when you want to restrict from other users the functionality of crop or resize for particular image sizes, or to just hide the image sizes you added to global ignore.
ro_ro: Aceasta este utilă când doriți să restricționați altor utilizatori funcționalitatea de tăiere sau scalare pentru anumite mărimi de imagine, sau pur și simplu să ascundeți mărimilor de imagine marcate ca ignoră global.

source: If you set the image size as ignored or unavailable, this will not be listed in the media screen when the dropdown of image sizes will be shown.
ro_ro: Dacă setați mărimea de imagine ca ignorată sau indisponibilă, aceasta nu va fi listată în ecranul media când se afișează lista verticală cu mărimile de imagine.

source: This option allows you to set a default crop position for the images generated for a particular image size. This option will be applied when you chose to regenerate an individual image or all of these, and also when a new image is uploaded.
ro_ro: Această opțiune vă permite să setați o poziție implicită de tăiere a tuturor imaginilor generate pentru o anumită mărime de imagine. Opțiunea aceasta va fi aplicată când alegeți să regenerați o imagine individuală sau pe toate acestea, și de asemenea când se încarcă o nouă imagine.

source: This option allows you to clean up all the image generated for a particular image size you already have in the application, and that you do not use or do not want to use anymore on the front-end.
ro_ro: Această opțiune vă permite să curățați toate imaginile generate pentru o anumită mărume de imagine pe care deja o aveți în aplicație, și pe care nu o folosiți sau pe care nu mai doriți să o folosiți în partea frontală.

source: Please be careful, once you click to remove the images for a selected image size, the action is irreversible, the images generated up this point will be deleted from your folders and database records.
ro_ro: Vă rugăm să fiți atenți, din momentul în care apăsați să eliminați imaginile pentru mărimea de imagine selectată, imaginile generate până în acel moment vor fi șterse din directoare și din înregistrările din baza de date.

source: You can regenerate these later if you click the Regenerate button.
ro_ro: Le puteți regenera mai târziu dacă apăsați butonul de regenerare.

source: This option allows you to regenerate the images for the selected image size.
ro_ro: Această opțiune vă permite să regenerați imaginile pentru mărimea de imagine selectată.

source: Please be careful, once you click the button to regenerate the selected image size, the action is irreversible, the images already generated will be overwritten.
ro_ro: Vă rugăm să fiți atenți, din momentul în care apăsați butonul de regenerare pentru mărimea de imagine selectată, acțiunea este ireversibilă, imaginile generate deja vor fi suprascrise.

source: Image Sizes Options
ro_ro: Opțiuni pentru mărimi de imagine

source: ignore image size
ro_ro: ignoră mărimea de imagine

source: image quality
ro_ro: calitate imagine

source: force original option
ro_ro: forțează ca original

source: hide image preview from info view
ro_ro: ascunde previzualizare imaginii din caseta cu detalii

source: default crop position
ro_ro: poziție implicită pentru decupare

source: cleanup sub-sizes
ro_ro: curățare subdimensiuni

source: regenerate sub-sizes
ro_ro: regenerare subdimensiuni

source: Ignore
ro_ro: Ignoră

source: disable sub-size
ro_ro: dezactivare

source: Image Size Info
ro_ro: Informații mărime imagine

source: name, scale/crop, dimension
ro_ro: nume, scalare/decupare, dimensiune

source: Quality
ro_ro: Calitate

source: file compression
ro_ro: compresie fișier

source: use as original
ro_ro: folosește ca original

source: Hide Preview
ro_ro: Fără afișare

source: hide from views
ro_ro: ascunde din ecrane

source: Default Crop
ro_ro: Tăiere implicită

source: initial position
ro_ro: poziția inițială

source: removal
ro_ro: ștergere

source: scale/crop
ro_ro: scalare/decupare

source: reset to default quality
ro_ro: resetare la calitatea implicită

source: nothing selected
ro_ro: nimic selectat

source: global ignore
ro_ro: ignoră global

source: Please be aware that your are changing the quality of the images going further for this images size!
ro_ro: Vă rugăm să aveți în vedere că modificați calitatea imaginilor de acum înainte pentru această mărime de imagine!

source: quality
ro_ro: calitate

source: force original
ro_ro: forțează ca original

source: hide
ro_ro: ascunde

source: unavailable
ro_ro: indisponibilă

source: Sub-sizes
ro_ro: Mărimi

source: %1$s plugin was activated!
ro_ro: Modulul %1$s a fost activat!

source: <a href="%1$s" rel="noreferrer">%2$s Premium extensions</a> are available for this plugin.
ro_ro: Pentru acest modul sunt disponibile <a href="%1$s" rel="noreferrer">%2$s extensii premium</a>.

source: %5$sCheck out my other <a href="%1$s" target="_blank" rel="noreferrer">%2$s free plugins</a> on WordPress.org and the <a href="%3$s" target="_blank" rel="noreferrer">%4$s other extensions</a> available!
ro_ro: %5$sVezi și celelalte <a href="%1$s" target="_blank" rel="noreferrer">%2$s module gratuite</a> ale mele pe WordPress.org și <a href="%3$s" target="_blank" rel="noreferrer">%4$s alte extensii</a> disponibile!

source: Dismiss this notice.
ro_ro: Respingeți această notificare.

source: Please specify the site id (1 if not multisite).
ro_ro: Vă rugăm să săecificați ID-ul sitului (1 dacp nu este multisit).

source: Permalinks refresh
ro_ro: Actualizare legături permanente

source: Cache refresh
ro_ro: Actualizare cache

source: Rename files for attachment
ro_ro: Redenumire fișiere pentru atașament

source: Find and replace database content for attachment files
ro_ro: Găsește și înlocuiește conținutul din baza de date pentru fișierele atașamentului
