Repository: vbuchara/vbuchara-portfolio
Catalog: plugins/image-regenerate-select-crop/langs/sirsc-*.po
Languages: ro_ro

source: General Settings
ro_ro: Setări generale

source: Debug
ro_ro: Depanare

source: Features Manager
ro_ro: Manager extensii

source: This extension allows you to export and import the plugin settings from an instance to another. The export includes the general settings, the advanced rules, the media settings, and the additional sizes manages with this plugin.
ro_ro: Această extensie vă permite să exportați și să importați setările modulului dintr-o instanță în alta. Exportul include setările generale, regulile avansate, setările media și mărimile de imagine adiționale administrate cu aces modul.

source: This extension allows you to rename the images files (bulk rename, individual rename or image rename on upload). Also, the extension provides the feature to override the attachments attributes based on the feature settings.
ro_ro: Această extensie vă permite să redenumiți fișierele imaginilor (redenumire în masă, redenumire individuală sau redenumire imagine la încărcare). De asemenea, extensia furnizează posibilitatea de a suprascrie atributele atașamentelor în funcție de setările făcute.

source: This extension allows you to see details about your application uploads folder: the total files size, the number of folders (and sub-folders), the number of files.
ro_ro: Această extensie vă permite să vedeți detalii despre directorul uploads al aplicației: mărime totală a fișierelor, numărul de directoare (și sub-directoare), numărul de fișiere.

source: This extension allows you to analyze the files from your uploads folder (even the orphaned files, these not associated with attachment records in the database) and see details about their size, MIME type, attachment IDs, images sizes, etc.
ro_ro: Această extensie vă permite să analizați fișierele din directorul uploads (chiar și fișierele orfane, acelea neasociate cu înregistrări de atașament în baza de date) și să vedeți detalii despre dimensiune, tip MIME, ID-uri atașament, mărimi de imagini, etc.

source: Disabled
ro_ro: Inactivă

source: Enabled
ro_ro: Activă

source: Purchase
ro_ro: Cumpără

source: License Key
ro_ro: Cheie licență

source: Activate
ro_ro: Activează

source: Free
ro_ro: Gratuit

source: &euro; %1$s / year
ro_ro: &euro; %1$s / an

source: You will see here the available extensions compatible with the installed plugin version.
ro_ro: Aici veți vedea extensiile disponibile compatibile cu versiunea modulului instalat.

source: You can activate and deactivate these at any time.
ro_ro: Le puteți activa și dezactiva în orice moment.

source: No extension available at the moment.
ro_ro: Nicio extensie disponibilă momentan.

source: Every minute
ro_ro: În fiecare minut

source: the cron task has been scheduled
ro_ro: procesul cron a fost planificat

source: hours
ro_ro: ore

source: minutes
ro_ro: minute

source: seconds
ro_ro: secunde

source: the cron task has been unscheduled and run for %s.
ro_ro: procesul cron s-a terminat și a durat %s.

source: Remaining to regenerate
ro_ro: Rămân să se regenereze

source: Remaining to clean up
ro_ro: Rămân să se curețe

source: Cron Task
ro_ro: Proces cron

source: The action has been scheduled and the cron task will run in the background. You can close the dialog box.
ro_ro: Acțiunea a fost planificată și procesul cron va rula în fundal. Puteți închide căsuța de dialog.

source: The action is currently in progress, the cron task runs in the background. You can close the dialog box.
ro_ro: Acțiunea este în desfășurare și procesul cron rulează în fundal. Puteți închide căsuța de dialog.

source: The cron task is scheduled to run every minute, please be patient until the task finishes.
ro_ro: Procesul cron este planificat să ruleze la fiecare minut, vă rugăm să aveți răbdare până se termină.

source: If you want to cancel the remaining execution and unshedule the task, click the button below.
ro_ro: Dacă vreți să opriți execuția rămasă și să ștergeți procesul, apăsați pe butonu de mai jos.

source: Cancel execution
ro_ro: Termină execuția

source: The scheduled task has been canceled.
ro_ro: Procesele planificate au fost înlăturate.

source: You will see here the information collected while executing regenerate and cleanup actions. Please reset the logs periodically.
ro_ro: Aici puteți vedea informațiile colectate în timpul execuției acțiunilor de regenerare și curățare. Vă rugăm să resetați istoricele periodic.

source: Bulk actions log
ro_ro: Istoric acțiuni în masă

source: The bulk actions execution results can be seen below, the most recent actions are shown at the top of the list.
ro_ro: Rezultatele notabile pentru acțiunile în masă se pot vedeam mai jos, cele mai recente acțiuni sunt afișare la începutul listei.

source: Tracer log
ro_ro: Istoric urmărire

source: The tracer log can be seen below, the most recent events are shown at the top of the list.
ro_ro: Istoricul de urmărire se poate vedeam mai jos, cele mai recente acțiuni sunt afișare la începutul listei.

source: disable verbose mode
ro_ro: dezactivare mod detaliat

source: when enabling/disabling verbose mode, the current log will be reset
ro_ro: când se activează/dezactivează modul detaliat, istoricul curent se resetează

source: Actions log
ro_ro: Istoric acțiuni

source: The custom debug log for monitoring the events execution is not available currently, because your site configuration does not allow for writting files.
ro_ro: Istoricul personalizat de urmărire a evenimentelor pentru depanare nu este disponibil momentan, deoarece configurația sitului dumneavoastră nu permite scrierea de fișiere.

source: Status/Debug
ro_ro: Stare/Depanare

source: Here are some details about your current instance and the services versions. These are useful for troubleshooting.
ro_ro: Aici sunt câteva detalii despre instanța curentă și versiunile serviciilor. Acestea sunt utile pentru depanare.

source: Crop image
ro_ro: Decupare imagine

source: Scale image
ro_ro: Scalare imagine

source: not found
ro_ro: nu s-a găsit

source: Custom quality
ro_ro: Calitate personalizată

source: must scale up to generate the expected size
ro_ro: trebuie mărită pentru a genera mărimea așteptată

source: The width and height of the original image are smaller than the requested image size.
ro_ro: Lățimea și înălțimea imaginii originale sunt mai mici decât mărimea de imagine cerută.

source: Cleanup the metadata
ro_ro: Curățarea metadatelor

source: This image size shares the same file as the full size (the original image) and it cannot be altered.
ro_ro: Această mărime de imagine partajează același fișier ca mărimea completă (imaginea originală) și acesta nu poate fi modificat.

source: Delete
ro_ro: Șterge

source: Info
ro_ro: Informații

source: Default quality
ro_ro: Calitate implicită

source: Skipping the regeneration of this file, the file already exists (as per settings).
ro_ro: Se sare peste generarea acestui fișier, fișierul există deja (conform setărilor).

source: Something went wrong!
ro_ro: Ceva a decurs greșit!

source: Done!
ro_ro: Gata!

source: You can see below some additional information about the files generated, recorded in the database, also files left behind from image sizes that are no longer registered in your site, or other image processing (but not linked in the database anymore, hence, probably no used anymore).
ro_ro: Puteți vedea mai jos câteva informații adiționale despre fișierele generate, înregistrate în baza de date, de asemenea fișiere rămase de la mărimi de imagine care nu mai sunt înregistrate în situl dumneavoastră, sau de la alte procesări de imagini (dar care nu mai sunt înregistrate în baza de date, așadar, probabil nefolosite).

source: Nothing available.
ro_ro: Nimic disponibil.

source: The file is missing!
ro_ro: Fișierul lipsește!

source: file size
ro_ro: mărime fișier

source: Image Details & Options
ro_ro: Detalii & opțiuni imagine

source: The original image
ro_ro: Imaginea originală

source: Image size details & generated image
ro_ro: Detalii mărime & imagine generată

source: Actions
ro_ro: Acțiuni

source: scale
ro_ro: redimensionare

source: to max width of
ro_ro: la lățime maximă de

source: to max height of
ro_ro: la înălțime maximă de

source: crop
ro_ro: decupare

source: of
ro_ro: la

source: or to max height of
ro_ro: sau la înălțime maximă de

source: Click to generate a crop of the image from this position
ro_ro: Apăsați ca să generați o decupare a imaginii din această poziție

source: Default crop position from settings
ro_ro: Poziție implicită de decupare din setări

source: Finishing up
ro_ro: Finalizare

source: Skipping the cleanup or this file (it is the original file).
ro_ro: Se sare peste curățarea acestui fișier (acesta este fișierul original).

source: Skipping the cleanup or this file (the size is registered).
ro_ro: Se sare peste curățarea acestui fișier (mărimea de imagine este înregistrată).

source: has been deleted.
ro_ro: s-a șters.

source: could not be deleted.
ro_ro: nu a putut fi șters.

source: No cleanup necessary for
ro_ro: Nu este necesară curățarea pentru

source: could not be found.
ro_ro: nu s-a găsit.

source: could not be deleted (it is the original file).
ro_ro: nu s-a putut șterge (este fișierul original).

source: Skipping the regeneration of this file (as per settings).
ro_ro: Se sare peste regenerarea acestui fișier (conform setărilor).

source: Could not generate, the original is too small.
ro_ro: Nu se poate genera, originalul este prea mic.

source: The file was regenerated.
ro_ro: Fișierul a fost regenerat.

source: Could not generate, the original file is missing.
ro_ro: Nu se poate genera, fișierul original lipsește.

source: Cron task is scheduled
ro_ro: Procesul cron este planificat

source: Cleanup
ro_ro: Curățare

source: Resume
ro_ro: Continuă

source: Regenerate All
ro_ro: Regenerează tot

source: Cleanup Unused
ro_ro: Curățare nefolosite

source: Cleanup Raw
ro_ro: Curățare brută

source: Button
ro_ro: Buton

source: Cancel
ro_ro: Anulare

source: Finish
ro_ro: Finalizare

source: Image Regenerate & Select Crop settings are not configured yet.
ro_ro: Setările pentru regenerare & tăiere selectivă imagine nu sunt configurate încă.

source: The original filesize is too big and the server does not have enough resources to process it.
ro_ro: Dimensiunea fișierului original este prea mare și serverul nu are resurse suficiente pentru a-l procesa.

source: <b>Unfortunately, there was an error</b>. Some of the execution might not have been successful. This can happen when: <br>&bull; the image you were trying to delete is <b>the original</b> file,<br>&bull; the image size was pointing to the <b>the original</b> and it should not be removed,<br>&bull; the <b>file is missing</b>.%1$sSee the details: %2$s
ro_ro: <b>Din păcate, a apărut o eroare</b>. O parte din execuție s-ar putea să nu fi reușit. Acest lucru se poate întâmpla când: <br>&bull; imaginea pe care ați încercat să o ștergeți este fișierul <b>original</b>,<br>&bull; mărimea de imagine face referire la <b>original</b> și acesta nu ar trebui șters,<br>&bull; <b>fișierul lipsește</b>.%1$sVedeți detaliile: %2$s

source: <b>Unfortunately, there was an error</b>. Some of the execution might not have been successful. This can happen in when: <br>&bull; the image from which the script is generating the specified image size does not have the <b>proper size</b> for resize/crop to a specific width and height,<br>&bull; the attachment <b>metadata is broken</b>,<br>&bull; the original <b>file is missing</b>,<br>&bull; the image that is processed is <b>very big</b> (rezolution or size) and the <b>allocated memory</b> on the server is not enough to handle the request,<br>&bull; the overall processing on your site is <b>too intensive</b>.%1$sSee the details: %2$s
ro_ro: <b>Din păcate, a apărut o eroare</b>. O parte din execuție s-ar putea să nu fi reușit. Acest lucru se poate întâmpla când: <br>&bull; imaginea din care scriptul generează mărimea specificată a imaginii nu are dimensiunea <b>potrivită</b> pentru redimensionare/tăiere la o anumită lățime și înălțime,<br>&bull; atașamentul are <b>metadatele corupte</b>,<br>&bull; fișierul original <b>lipsește</b>,<br>&bull; imaginea care este procesată este <b>foarte mare</b> (rezoluție sau dimensiune) și <b>memoria alocată</b> de pe server nu este suficientă pentru a face față cererii,<br>&bull; procesarea generală pe site-ul dvs. este <b>prea intensă</b>.%1$sVedeți detaliile: %2$s

source: The advanced custom rules you configure below are global and will override all the other settings you set above.
ro_ro: Regulile personalizate avansate pe care le configurați mai jos sunt globale și vor suprascrie toate celelalte setări făcute mai sus.

source: Please be aware that the custom rules will apply only if you actually set up the post to use one of the rules below, and only then upload images to that post.
ro_ro: Vă rugăm să aveți în vedere că regulile personalizate se vor aplica numai dacă mai întâi setați articolul să folosească una dintre regulile de mai jos, și abia apoi încărcați imaginile la acel articol.

source: Advanced custom rules based on the post where the image will be uploaded
ro_ro: Reguli personalizate avansate în funcție de articolul unde se încarcă imaginea

source: Very important: the order in which the rules are checked and have priority is: post ID, post type, post format, post parent, post tags, post categories, other taxonomies. Any of the rules that match first in this order will apply for the images that are generated when you upload images to that post (and the rest of the rules will be ignored). You can suppress at any time any of the rules and then enable these back as it suits you.
ro_ro: Foarte important: ordinea în care se verifică și în care au prioritate regulile este: ID articol, tip articol, format articol, părinte articol, etichete articol, categorii articol, alte taxonomii. Oricare dintre reguli care se potrivește prima în această ordine se va aplica pentru imaginile care se generează când încărcați imagini la acel articol (și restul regulilor vor fi ignorate). Puteți suprima în orice moment oricare dintre reguli ca apoi să le activați la loc după cum vă este convenabil.

source: Post ID
ro_ro: ID articol

source: Post parent ID
ro_ro: ID articol părinte

source: Post type
ro_ro: Tip articol

source: Set below rules that would apply only for regenerating the featured image. An image becomes a "Featured Image" after the upload was already processed and when the post is saved, hence the rules set below can apply only when regenerating the image.
ro_ro: Aplicați mai jos regulie care să se aplice doar pentru regenerarea imaginii reprezentative. O imagine devine "Imagine reprezentativă" după ce încărcarea s-a procesat deja și doar când articolul este salvat, așadar, regulile setate mai jos se pot aplica doar pentru regenerarea imaginii.

source: The post has
ro_ro: Articolul are

source: Ex: Categories
ro_ro: Ex: Categorii

source: Value
ro_ro: Valoare

source: Ex: gallery,my-photos
ro_ro: Ex: galerie,pozele-mele

source: Force original
ro_ro: Forțează ca original

source: Generate only these image sizes for the rule
ro_ro: Generează doar aceste mărimi de imagine pentru regulă

source: Suppress
ro_ro: Suprimă

source: This rule is SUPPRESSED
ro_ro: Regula este SUPRIMATĂ

source: This rule is ACTIVE
ro_ro: Regula este ACTIVĂ

source: uploading images to a post that has %1$s as %2$s will generate only the %3$s sizes.
ro_ro: încărcând imagini la un articol care are %1$s ca %2$s se vor genera doar mărimile %3$s.

source: uploading images to a post that has %1$s as %2$s will force the original image to %3$s size and will generate only the %4$s sizes.
ro_ro: încărcând imagini la un articol care are %1$s ca %2$s se va forța imaginea originală la dimensiunea %3$s și se vor genera doar mărimile %4$s.

source: Rules that would apply only for regenerating the featured image
ro_ro: Reguli ce se vor aplica doar la regenerarea imaginii reprezentative

source: General Cleanup
ro_ro: Curățare generală

source: It is recommended to run the cleanup using the command line tools.
ro_ro: Este recomandat să rulați curățarea folosind instrumente de linie de comandă.

source: However, if you do not have access to wp-cli on your server, you could run the cleanup actions by using the cron tasks, or, if you have a small set of images to cleanup, by using the plugin dialog.
ro_ro: Totuși, dacă nu aveți acces la wp-cli pe serverul dumneavoastră, ați putea rula acțiunile de curățare folosind procesele cron, sau, dacă aveți de curățat un set mic de imagini, folosind interfața modulului.

source: Cleanup unused files and keep currently registered sizes files
ro_ro: Curățare fișiere nefolosite și păstrare fișiere ale mărimilor înregistrate momentan

source: This type of cleanup is performed for all the attachments, and it removes any attachment unused file and keeps only the files associated with the currently registered image sizes. This action is also changing the attachment metadata in the database, and it is irreversible.
ro_ro: Acest tip de curățare se aplică tuturor atașamentelor, și șterge orice fișier nefolosit al atașamentului, păstrând doar fișierele asociate cu mărimile de imagine înregistrate momentan. Această acțiune schimbă de asemenea și metadata atașamentului în baza de date, și este ireversibilă.

source: Keep only the original/full size files
ro_ro: Păstrare doar a fișierelor la mărimea originală/întreagă

source: This type of cleanup is performed for all the attachments, and it keeps only the file associated with the original/full size. This action is also changing the attachment metadata in the database, and it is irreversible. After this process is done, you need to regenerate the files for the desired image sizes.
ro_ro: Acest tip de curățare se aplică tuturor atașamentelor, și păstrează doar fișierul asociat cu mărimea originală/întreagă. Această acțiune schimbă de asemenea și metadata atașamentului în baza de date, și este ireversibilă. După ce procesul este gata, va trebui să regenerați fișierele pentru mărimile de imagine dorite.

source: Cron Tasks
ro_ro: Procese cron

source: execute bulk actions using the WordPress cron tasks instead of the default interface
ro_ro: executați acțiunile în masă folosind procesele cron native WordPress în locul interfeței implicite

source: This option allows you to offload the execution of bulk actions to the WordPress cron tasks. This will run the intended actions as background tasks, instead of using the plugin default interface.
ro_ro: Această opțiune vă permite să descărcați execuția acțiunilor în masă pe seama proceselor cron WordPress. Acestea vor rula acțiunile desemnate ca și procese în fundal, în locul interfeței implicite a modulului.

source: You will have to adjust the batches size based on your server settings and limitations.
ro_ro: Va trebui să ajustați dimensiunea loturilor în funcție de setările și limitările serverului dumneavoastră.

source: If the batch size is big, the whole processing will finish faster, but it can fail if your server runs out of resources. Setting a small size for the batch will encrease the time required for the whole processing to finish, but is less resource intensive.
ro_ro: Dacă dimensiunea lotului este mare, toată procesarea se termină mai rapid, dar pot apărea erori dacă serverul dumneavoastră rămâne fără resurse. Dacă setați o dimensiune mai mică pentru lot, timpul necesar execuției se mărește, dar nu se solicită atât de multe resurse.

source: the number of images to be regenerated at each cron task iteration
ro_ro: numărul de imagini care să fie regenerate la fiecare iterație a procesului cron

source: the number of images to be cleanup at each cron task iteration
ro_ro: numărul de imagini care să fie curățate la fiecare iterație a procesului cron

source: Cancel all currently scheduled tasks that aim to regenerate or cleanup the images.
ro_ro: Anulați toate procesele planificate ce vizează regenerarea sau curățarea imaginilor.

source: show small buttons in the media screen
ro_ro: afișare butoane mici în ecranul media

source: show buttons in the media screen in grid mode
ro_ro: afișare butoane în ecranul media în mod grilă

source: show attachment image sizes summary in the media screen
ro_ro: afișare sumar mărimi de imagine atașament în ecranul media

source: turn off the WooCommerce background thumbnails regenerate
ro_ro: dezactivați regenerarea în fundal a miniaturilor prin WooCommerce

source: sync ignored image sizes with EWWW Image Optimizer plugin
ro_ro: sincronizați mărimile de imagine ignorate cu modulul EWWW Image Optimizer

source: This option allows you to sync <em>disable creation</em> image sizes from <b>EWWW Image Optimizer</b> plugin with the <em>global ignore</em> image sizes from <b>Image Regenerate & Select Crop</b>. In this way, when you update the settings in one of the plugins, the settings will be synced in the other plugin.
ro_ro: Această opțiune vă permite să sincronizați mărimile de imagine <em>dezactivate de la generare</em> din modulul <b>EWWW Image Optimizer</b> cu mărimile de imagine <em>ignorate global</em> în <b>Image Regenerate & Select Crop</b>. În acest fel, când actualizați setările într-unul dintre module, setările vor fi sincronizate în celălalt modul.

source: bulk regenerate/cleanup execution starts from the most recent files
ro_ro: execuția în masă a regenerării/curățării începe de la cele mai recente fișiere

source: This option allows you to run the bulk cleanup and bulk regenerate actions starting from the most recent files you have in the media library until the most old image is found. This is useful if you know when you can pause/stop the bulk actions, for example when you already run the bulk actions for older files and you only need to run this for more recent uploads.<hr>By default, the bulk actions will run from the oldest to the newest files.
ro_ro: Această opțiune vă permite să rulați execuția în masă a regenerării și a curățării de la cele mai recente fișiere pe care le aveți în librăria media până la cea mai veche imagine găsită. Aceasta este utilă dacă știți când să întrerupeți/opriți acțiunile în masă, spre exemplu când ați rulat deja acțiuni în masă pentru fișiere mai vechi și aveți nevoie să rulați acestea doar pentru încărcări mai recente.<hr>Implicit, acțiunile în masă rulează de la cele mai vechi până la cele mai noi fișiere.

source: do not cleanup the settings after the plugin is deactivated
ro_ro: nu curățați setările după ce modulul este dezactivat

source: turn on the custom debug log for monitoring the events execution
ro_ro: activați istoricul de depanare personalizat pentru a monitoriza execuția evenimentelor

source: filter and expose the image sizes available for the attachment display settings in the media dialog (any registered available size, even when there is no explicit filter applied)
ro_ro: filtrare și dezvăluire a mărimilor de imagine disponibile pentru setările de afișare ale atașamentului în dialogul media (orice mărime înregistrată disponibilă, chiar dacă nu este aplicat niciun filtru explicit)

source: Other Settings
ro_ro: Alte setări

source: These settings are targetting only the post type you selected above.
ro_ro: Acestă setări se aplică doar pentru tipul de articol selectat mai sus.

source: generate only perfect fit sizes
ro_ro: se generează doar mărimi care se potrivesc perfect
