Repository: vbuchara/vbuchara-portfolio
Catalog: plugins/image-regenerate-select-crop/langs/sirsc-*.po
Languages: ro_ro

source: Image Regenerate & Select Crop
ro_ro: Regenerare & tăiere selectivă imagine

source: Regenerate and crop images, details and actions for image sizes registered and image sizes generated, clean up, placeholders, custom rules, register new image sizes, crop medium settings, WP-CLI commands, optimize images.
ro_ro: Regenerare și tăiere imagini, detalii și acțiuni pentru mărimi de imagine înregistrate și mărimi de imagine generate, curățare, substituenți, reguli personalizate, înregistrare mărimi noi de imagine, setări de tăiere medie, comenzi WP-CLI.

source: Bulk rename
ro_ro: Redenumire în masă

source: The initial filename was recorded.
ro_ro: Numele inițial al fișierului a fost înregistrat.

source: The attachment %s was updated.
ro_ro: S-a modificat %s pentru atașament.

source: alternative text
ro_ro: textul alternativ

source: title
ro_ro: titlul

source: permalink
ro_ro: legătura permanentă

source: No changes for %s
ro_ro: Nicio modificare pentru %s

source: + %1$d more image sizes that were found for this
ro_ro: + încă %1$d mărimi de imagine ce au fost găsite pentru aceasta

source: Attachment ID
ro_ro: ID atașament

source: New Title
ro_ro: Titlu nou

source: Images SEO
ro_ro: SEO pentru imagini

source: You can rename this attachment files (including the files generated as image sizes) and other attributes.
ro_ro: Puteți redenumi fișierele acestui atașament (inclusiv fișierele generate ca mărimi de imagine) și alte atribute.

source: You can rename and update attributes of some of the files already uploaded or attached to this post.
ro_ro: Puteți redenumi și modifica atribute ale unora dintre fișierele deja încărcate sau atașate la acest articol.

source: Settings
ro_ro: Setări

source: Bulk rename images
ro_ro: Redenumire imagini în masă

source: Rename images
ro_ro: Redenumire imagini

source: Rename result
ro_ro: Rezultat redenumire

source: This feature works when you select an image.
ro_ro: Funcționalitatea necesită selectarea unei imagini.

source: If you want to start the bulk rename of images, you have to select at least one post type, then click the bulk rename button.
ro_ro: Dacă doriți să inițiați redenumirea în masă a imaginilor, trebuie să selectați cel puțin un tip de articol, apoi să apăsați butonul de redenumire în masă.

source: If you have a large set of files, we recommend using the command line tools for performance and speed reasons. If you can run commands from the terminal, you could use the wp-cli command. When you run the command it will prompt for you to enter the site id (or 1 if you are not using a multi-site) and the post type for which you want to bulk rename the files (if multiple, then separate these with commas).
ro_ro: Dacă aveți un set mare de fișiere, recomandăm să folosiți instrumentele din linia de comandă, din motive de performanță și viteză. Dacă puteți rula comenzi din terminal, puteți folosi comanda wp-cli. Când rulați comanda, vi se cere să introduceți ID-ul sitului (sau 1 dacă nu folosiți un multi-sit) și tipul de articol pentru care vreți să redenumiți fișierele în masă (dacă sunt mai multe, atunci separați-le cu virgule).

source: Make sure you back up your files and database before running any bulk action, some changes cannot be reverted from the browser.
ro_ro: Asigurați-vă că faceți o copie de siguranță a fișierelor si a bazei de date înainte de a rula orice acțiune în masă, unele modificări nu se pot restaura din browser.

source: Nothing to be processed.
ro_ro: Nimic de procesat.

source: Bulk renaming files
ro_ro: Redenumire fișiere în masă

source: The identified images were renamed.
ro_ro: Imaginile identificate au fost redenumite.

source: Processed the filename replacement for %1$d items of %2$d.
ro_ro: S-a procesat înlocuirea numelor fișierelor pentru %1$d elemente din %2$d.

source: The image inherited the title from the post that is using this as featured image.
ro_ro: Imaginea a moștenit titlul de la articolul care o folosește ca imagine reprezentativă.

source: The image inherited the title from the product that is using this as gallery image.
ro_ro: Imaginea a moștenit titlul de la produsul care o folosește ca imagine de galerie.

source: The image inherited the title from the post parent of the image.
ro_ro: Imaginea a moștenit titlul de la articolul care este părintele imaginii.

source: The image inherited the title from the attachment title.
ro_ro: Imaginea a moștenit titlul de la titlul atașamentului.

source: No target selected.
ro_ro: Nimic selectat.

source: Please note that any of the rename process options (on upload, manual rename, bulk rename) will override the attachment attributes based on the images SEO settings you made.
ro_ro: Vă rugăm să notați că oricare dintre opțiunile procesului de redenumire (la încărcare, redenumire manuală, redenumire în masă) vor suprascrie atributele atașamentului în funcție de setările SEO pentru imagini pe care le-ați făcut.

source: The bulk rename process is targeting images set as <b>featured image</b> (for all post types selected that support the featured image feature) or attached as <b>media</b> (uploaded to that posts as children).
ro_ro: Procesul de redenumire în masă vizează imaginile setate ca <b>imagine reprezentativă</b> (pentru toate tipurile de articole care suportă imagine reprezentativă) sau atașate ca <b>media</b> (încărcate la acel articol ca și copii).

source: For products, the rename will include also the <b>gallery images</b>.
ro_ro: Pentru produse, redenumirea va include de asemenea <b>galeria de imagini</b>.

source: Rename attachment file
ro_ro: Redenumire fișier atașament

source: You can change the title below, then click the button to rename the attachment file, and the generated image sizes.
ro_ro: Puteți schimba mai jos titlul, apoi apăsați pe buton ca să redenumiți fișierul atașamentului și mărimile de imagine generate.

source: Rename
ro_ro: Redenumire

source: Attachment image
ro_ro: Imagine atașament

source: Go to
ro_ro: Mergeți la

source: You can change the title below, then click the button to rename the identifies images associated with this post, and their generated image sizes.
ro_ro: Puteți schimba mai jos titlul, apoi apăsați pe buton ca să redenumiți imaginile identificate ca asociate cu acest articol și mărimile de imagine generate pentru ele.

source: Images attached to the post
ro_ro: Imagini atașate la articol

source: Rename log
ro_ro: Istoric redenumire

source: Reset log
ro_ro: Resetare istoric

source: The SEO Images rename log can be seen below, the most recent events are shown at the bottom of the list. This log will reset if you run the wp-cli commands.
ro_ro: Istoricul de redenumiri Imagini SEO se poate vedea mai jos, cele mai recente evenimente sunt arătate la sfârșitul listei. Acest istoric se resetează dacă rulați comenzile wp-cli.

source: Run the following command in your terminal to see more details about this.
ro_ro: Rulați următoarea comandă în terminalul dumneavoastră pentru a vedea mai multe detalii despre aceasta.

source: If you cannot run wp-cli commands, you can use the data from this log to make your own find-replace script that replaces the old strings with new strings in your database, if you have hardcoded URLs for the images. Each line represents a string to be replaced, the first part before the comma is the old reference, the second part is the new reference.
ro_ro: Dacă nu puteți rula comenzi wp-cli, puteți folosi informația din acest istoric pentru a vă construi propriul script de identificare-înlocuire a vechilor șiruri de caractere cu noile șiruri de caractere în baza de date, dacă aveți URL-uri hard-codate pentru imagini. Fiecare linie reprezintă un string de înlocuit, prima parte de dinainte de virgula este vechea referință, partea a doua este noua referință.

source: If you cannot run wp-cli commands, you can use the data from this log to make your own find-replace script that replaces the old strings with new strings in your database (or use WP Migrate DB PRO plugin find-replace feature), if you have hardcoded URLs for the images. Each line represents a string to be replaced, the first part before the comma is the old reference, the second part is the new reference.
ro_ro: Dacă nu puteți rula comenzi wp-cli, puteți folosi informația din acest istoric pentru a vă construi propriul script de identificare-înlocuire a vechilor șiruri de caractere cu noile șiruri de caractere în baza de date, dacă aveți URL-uri hard-codate pentru imagini. Fiecare linie reprezintă un string de înlocuit, prima parte de dinainte de virgula este vechea referință, partea a doua este noua referință.

source: What Does Images SEO Do?
ro_ro: Ce face SEO Pentru Imagini?

source: You can enable/disable any of the actions that the SEO rename extension is providing. The ones enabled will be used for processing images on upload, on bulk rename, and on manual rename too.
ro_ro: Puteți activa/dezactiva oricare dintre acțiunile pe care extensia de redenumire SEO le furnizează. Cele pe care le activați vor fi folosite la procesarea imaginilor la încărcare, la redenumirea în masă și de asemenea la redenumirea manuală.

source: Rename Files
ro_ro: Redenumire fișiere

source: Enable this to rename the attachment files (also the image sizes generated).
ro_ro: Activați opțiunea pentru a redenumi fișierele atașamentului (inclusiv mărimile de imaginile generate).

source: Track Initial File
ro_ro: Memorare fișier inițial

source: Enable this to keep a record of the initial filename if the file is renamed.
ro_ro: Activați opțiunea pentru a păstra o înregistrare a numelui fișierului inițial dacă fișierul se redenumește.

source: Override Title
ro_ro: Suprascriere titlu

source: Enable this to override the attachment title with the inherited title.
ro_ro: Activați pentru a suprascrie titlul atașamentului cu titlul moștenit.

source: Override Alternative
ro_ro: Suprascriere alternativ

source: Enable this to override the attachment alternative text with the inherited title.
ro_ro: Activați pentru a suprascrie textul alternativ al atașamentului cu titlul moștenit.

source: Override Permalink
ro_ro: Suprascriere legătură permanentă

source: Enable this to override the attachment permalink with the inherited title.
ro_ro: Activați pentru a suprascrie legătură permanentă a atașamentului cu titlul moștenit.

source: Show rename button
ro_ro: Afișare buton redenumire

source: For the selected post types there will be shown a meta box with the button to rename the associated files.
ro_ro: Pentru tipurile de articole selectate se va afișa o căsuță meta cu un buton de redenumire a fișierelor asociate.

source: Rename images on upload
ro_ro: Redenumire imagini la încărcare

source: Attempt to automatically rename the files on upload to these post types (these post parent types).
ro_ro: Se încearcă redenumirea automată a fișierelor când se încarcă la aceste tipuri de articole (părinți de aceste tipuri).

source: Bulk rename images for types
ro_ro: Redenumire în masă a imaginilor pentru tipuri

source: These will be the post types that will be available to select in the bulk rename process.
ro_ro: Acestea for fi tipurile de articole ce vor fi disponibile pentru selecție în procesul de redenumire în masă.

source: Save Settings
ro_ro: Salvare setări

source: Please note that any of the rename process options (on upload, manual rename, bulk rename) will take into account the currently enabled settings, this will not apply retroactively.
ro_ro: Vă rugăm să notați că oricare dintre opțiunile procesului de redenumire (la încărcare, redenumire manuală, redenumire în masă) vor lua în calcul setările activate momentan, acestea nu se aplică retroactiv.

source: The plugin settings have been imported successfully.
ro_ro: Setările modulului au fost importate cu succes.

source: The plugin settings were not imported, something went wrong.
ro_ro: Setările modulului nu au fost importate, ceva nu a funcționat.

source: Please note that the import/export of the settings is in relation with the image sizes that are found on the instance, through the plugins that are activated and also the theme settings. You might need to partially adjust these manually after an import.
ro_ro: Vă rugăm să notați că importul/exportul setărilor este în relație cu mărimile de imagine care sunt găsite în această instanță, prin intermediul modulelor care sunt activate și de asemenea prin setările temei. Este posibil să fie necesar să le ajustați manual după un import.

source: Export Settings
ro_ro: Export setări

source: Copy the settings and import these into another instance.
ro_ro: Copiați setările și importați-le în altă instantă.

source: Import Settings
ro_ro: Import setări

source: Paste here the settings and import these into the current instance.
ro_ro: Lipiți aici setările și importați-le în instanța curentă.

source: Registered Image Sizes
ro_ro: Mărimi de imagine înregistrate

source: If you deactivate the plugin but still want to keep the image sizes you registered with this plugin, you can copy the snippet in your theme functions.php file or in a plugin.
ro_ro: Dacă dezactivați modului dar vreți să păstrați în continuare mărimile de imagine înregistrate cu acest modul, puteți copia snipetul în fișierul functions.php al temei voastre sau într-un modul.

source: Refresh
ro_ro: Actualizare

source: Uploads Folder Info
ro_ro: Info director uploads

source: Folder summary
ro_ro: Sumar director

source: Refresh summary
ro_ro: Actualizare sumar

source: Click to refresh summary & folder details. This will refresh the totals and counts if something was updated in the meanwhile.
ro_ro: Apăsați pentru a actualiza sumarul & detaliile directorului. Aceasta va actualiza totalurile și numerele dacă ceva a fost modificat între timp.

source: Upload folder
ro_ro: Director upload

source: Size
ro_ro: Mărime

source: bytes
ro_ro: biți

source: Total folders
ro_ro: Total directoare

source: Total files
ro_ro: Total fișiere

source: Currenty, there is no info.
ro_ro: Nicio informație pentru moment.

source: Folder
ro_ro: Director

source: Total size
ro_ro: Mărime totală

source: Total bytes
ro_ro: Total biți

source: Folder Details
ro_ro: Detalii director

source: List
ro_ro: Listă

source: Assess
ro_ro: Evaluare

source: Uploads Inspector
ro_ro: Inspector uploads

source: Assess uploads
ro_ro: Evaluare uploads

source: Click to assess the files from uploads folder & refresh the info.
ro_ro: Apăsați pentru a evalua fișierele din directorul uploads & actualizare informațiilor.

source: This option will initiate the assessment of the uploads structure and contents, and will collect information that can be checked later.
ro_ro: Această opțiune va iniția evaluarea structurii și conținutului directorului uploads, și va colecta informații care pot fi vizualizate mai târziu.

source: Click to refresh summary. This will refresh the totals and counts if something was updated in the meanwhile.
ro_ro: Apăsați pentru a actualiza sumarul. Aceasta va actualiza totalurile și numerele dacă ceva a fost modificat între timp.

source: This option will also stop the assessment, if that is currently in progress.
ro_ro: Această opțiune va opri și evaluarea, dacă aceasta este momentan în derulare.

source: Processing the request for
ro_ro: Se procesează cererea pentru

source: files
ro_ro: fișiere

source: Files Info
ro_ro: Info fișiere

source: The most recent files assessment was executed on %1$s.
ro_ro: Cea mai recentă evaluare a fișierelor s-a efectuat în %1$s.

source: Click the files counts below to open the list of assessed items.
ro_ro: Apăsați pe contoarele fișierelor de mai jos pentru a deschide lisa de elemente evaluate.

source: There are %1$d items assessed out of %2$d.
ro_ro: Au fost evaluate %1$d elemente din %2$d.

source: Page %1$s of %2$s
ro_ro: Pagina %1$s din %2$s

source: File
ro_ro: Fișier

source: MIME Type
ro_ro: Tip MIME

source: File size
ro_ro: Mărime fișier

source: Image Size
ro_ro: Mărime imagine

source: Attachment
ro_ro: Atașament

source: unknown
ro_ro: necunoscut

source: Counter
ro_ro: Contor

source: In option
ro_ro: În opțiune

source: MIME type
ro_ro: Tip MIME

source: Images sizes
ro_ro: Mărimi imagini

source: Valid images
ro_ro: Imagini valide

source: Left
ro_ro: Stânga

source: Top
ro_ro: Sus

source: Center
ro_ro: Centru

source: Right
ro_ro: Dreapta

source: Bottom
ro_ro: Jos

source: Action not allowed.
ro_ro: Acțiune nepermisă.

source: Security Breach
ro_ro: Breșă de securitate

source: currently registered
ro_ro: înregistrată momentan

source: not registered anymore
ro_ro: nu mai este înregistrată

source: never registered
ro_ro: niciodată înregistrată

source: Plugin URL
ro_ro: URL modul

source: was removed
ro_ro: s-a șters

source: Could not remove
ro_ro: Nu s-a putut șterge

source: The image is missing or it is the original file.
ro_ro: Imaginea lipsește sau este fișierul original.

source: METADATA cleanup performed for %d.
ro_ro: S-a executat curățarea METADATELOR pentru %d.

source: Advanced Rules
ro_ro: Reguli avansate

source: Media Settings
ro_ro: Setări media

source: Additional Sizes
ro_ro: Mărimi adiționale

source: Cleanup all?
ro_ro: Curăță tot?

source: Regenerate all?
ro_ro: Regenerează tot?

source: This operation might take a while, depending on how many images you have.
ro_ro: Această operațiune poate să dureze, în funcție de câte imagini aveți.

source: The operation is irreversible!
ro_ro: Această operațiune este ireversibilă!

source: Resolution
ro_ro: Rezoluție

source: Details/Options
ro_ro: Detalii/Opțiuni

source: Image Details
ro_ro: Detalii imagine

source: Regenerate
ro_ro: Regenerare

source: Raw Cleanup
ro_ro: Curățare brută

source: Regenerate Log
ro_ro: Jurnal regenerare

source: Cleanup Log
ro_ro: Jurnal curățare

source: This action will remove all images generated for this attachment, except for the original file. Are you sure you want proceed?
ro_ro: Această acțiune va înlătura toate imaginile genereate pentru acest atașament, exectând fișierul original. Siguri doriți să continuați?

source: Details
ro_ro: Detalii

source: Please make sure you visit and update your settings here whenever you activate a new theme or plugins, so that the new image size registered, adjusted or removed to be reflected also here, and in this way to assure the optimal behavior for the features of this plugin.
ro_ro: Vă rugăm să vă asigurați că revizitați și actualizați setările de aici ori de câte ori activați o nouă temă sau noi module, astfel încât noile mărimi de imagini înregistrate, modificate sau eliminate să fie reflectate și aici, și în acest fel să asigurați comportamentul optim al funcționalităților acestui modul.

source: Images Custom Settings
ro_ro: Setări personalizate pentru imagini

source: Define Custom Image Sizes
ro_ro: Definire dimensiuni personalizate de imagini

source: A huge thanks in advance!
ro_ro: Multe mulțumiri în avans!

source: If you find the plugin useful and would like to support my work, please consider making a <a href="%1$s" target="_blank" rel="noreferrer">donation</a>. It would make me very happy if you would leave a %2$s rating.
ro_ro: Dacă acest modul îți este folositor și ai dori să îmi sprijini munca, m-aș bucura dacă ai face o <a href="%1$s" target="_blank" rel="noreferrer">donație</a>. M-ar bucura mult dacă ai lăsa o recenzie de %2$s.

source: The plugin settings have been updated successfully.
ro_ro: Setările modului au fost actualizate cu succes.

source: You can override the default crop for the medium and large size of the images. Please note that the crop will apply to the designated image size only if it has both with and height defined (as you know, when you set 0 to one of the sizes, the image will be scaled proportionally, hence, the crop cannot be applied).
ro_ro: Puteți suprascrie tăierea implicită pentru imaginile medii și mari. Să aveți în vedere că tăierea se aplică mărimii de imagine desemnată doar dacă aceasta are și lățimea și înălțimea definite (după cum știți, când setați 0 la una dintre dimensiuni, imaginea va fi scalată proporțional, așadar, tăierea nu poate fi aplicată).

source: Medium size crop
ro_ro: Tăiere mărime medie

source: Crop the image to exact dimensions (normally images are proportional).
ro_ro: Decupează imaginea la dimensiuni exacte (în mod normal imaginile medii sunt proporționale).

source: Medium large size crop
ro_ro: Tăiere mărime medie mare

source: Large size crop
ro_ro: Tăiere mărime mare

source: Featured image size in meta box
ro_ro: Mărime imagine reprezentativă în căsuța meta

source: This setting allows you to change the post thumbnail image size that is displayed in the meta box. Leave empty if you want to use the default image size that is set by WordPress and your theme.
ro_ro: Această setare vă permite să schimbați mărimea de imagine a miniaturii pentru articol ce se afișează în caseta meta. Lăsați gol dacă doriți să folosiți mărimea de imagine implicită care este setată de către WordPress și tema dumneavoastră.

source: If you decided it is absolutely necessary to have new custom image sizes, you can make the setup below and these will be registered programmatically in your application if you configured these correctly (you have to input the size name and at least the width or height).
ro_ro: Dacă ați decis că este absolut necesar să aveți noi mărimi personalizate de imagine, puteți face setările mai jos și acestea vor fi înregistrate programatic în aplicația dumneavoastră, dacă sunt configurate corect (trebuie să introduceți denumirea dimensiunii și cel puțin lățimea sau înălțimea).

source: However, please make sure you only define these below if you are sure this is really necessary, as, any additional image size registered in your application is decreasing the performance on the images upload processing and also creates extra physical files on your hosting.
ro_ro: Totuși, vă rugăm să vă asigurați că le definiți mai jos doar dacă sunteți siguri că este chiar necesar, pentru că orice mărime de imagine adițională înregistrată în aplicație scade performanța la procesarea încărcării imaginilor și de asemenea creează fișiere fizice suplimentare la găzduire.

source: Also, please note that changing the image sizes names or width and height values is not recommended after these were defined and your application started to create images for these specifications.
ro_ro: În plus, vă rugăm să notați că modificarea denumirii sau a valorilor lățimii și înălțimii pentru mărimile de imagine nu se recomandă după ce acestea au fost definite și aplicația dumneavoastră a început să genereze imagini pentru specificațiile respective.

source: Use this feature wisely.
ro_ro: Utilizați această opțiune cu precauție.

source: Please consult with a front-end developer before deciding to define more image sizes below (and in general in the application), as most of the times just updating the native image sizes settings and updating the front-end code (the theme) is enough.
ro_ro: Vă rugăm să consultați un front-end developer înainte de a decide să definiți mai jos mai multe mărimi de imagine (și în general în aplicație), pentru că de cele mai multe ori este suficient doar să actualizați dimensiunile native de imagine și codul din partea frontală (tema).

source: Image Sizes Name
ro_ro: Denumire mărime imagine

source: Max Width
ro_ro: Lățime maximă

source: Max Height
ro_ro: Înălțime maximă

source: Crop
ro_ro: Decupare

source: (leave empty to remove this image size)
ro_ro: (lasă gol pentru a elimina această mărime de imagine)

source: Crop the image to exact dimensions
ro_ro: Decupează imaginea la dimensiuni exacte

source: New image size name
ro_ro: Denumire mărime imagine nouă

source: (normally images are proportional).
ro_ro: (în mod normal imaginile sunt proporționale)
